In [3]:
import numpy as np
import pandas as pd
from pandas import DataFrame,Series

In [4]:
ser1 = Series(np.arange(3),index=['A','B','C'])

In [5]:
ser1

A    0
B    1
C    2
dtype: int32

In [6]:
ser1.drop('B')

A    0
C    2
dtype: int32

In [7]:
dframe = DataFrame(np.arange(9).reshape(3,3),index=['SF','LA','NY'],columns=['pop','size','year'])

In [8]:
dframe

    pop  size  year
SF    0     1     2
LA    3     4     5
NY    6     7     8

In [9]:
dframe.drop('LA')

    pop  size  year
SF    0     1     2
NY    6     7     8

In [11]:
dframe

    pop  size  year
SF    0     1     2
LA    3     4     5
NY    6     7     8

In [12]:
dframe2 = dframe.drop('LA')

In [13]:
dframe2

    pop  size  year
SF    0     1     2
NY    6     7     8

In [14]:
dframe

    pop  size  year
SF    0     1     2
LA    3     4     5
NY    6     7     8

In [18]:
dframe.drop('year',axis=1)

    pop  size
SF    0     1
LA    3     4
NY    6     7